Revit 2026 API

# AirFanType Enumeration

---

The type of air fan.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AirFanType
```
```vb
Public Enumeration AirFanType
```
```cpp
public enum class AirFanType
```
```fsharp
type AirFanType
```

| Member name | Value | Description |
| --- | --- | --- |
| ConstantVolume | 0 |  |
| VariableVolume | 1 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace